In [1]:
import pandas as pd

In [ ]:
ratings = pd.read_csv("ml-100k/ml-100k/u.data", sep="\t", 
                      names=["user_id", "movie_id", "rating", "timestamp"])
ratings.to_csv("ratings.csv", index=False)

In [4]:
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [ ]:
# Movies (keep only ID and title for simplicity)
movies = pd.read_csv("ml-100k/ml-100k/u.item", sep="|", encoding="latin-1", 
                     header=None, usecols=[0, 1], names=["movie_id", "title"])
movies.to_csv("movies.csv", index=False)

In [7]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [ ]:
users = pd.read_csv("ml-100k/ml-100k/u.user", sep="|", 
                    names=["user_id", "age", "gender", "occupation", "zip_code"])
users.to_csv("users.csv", index=False)

In [9]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213